---
type: Area
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# Area

`Autodesk.Revit.DB.Area` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | AreaScheme | — | `public AreaScheme AreaScheme { get ; }` |
| Property | IsGrossInterior | — | `public bool IsGrossInterior { get ; }` |
| Property | Parameter | — | `` |